# Add services
tap 'homebrew/services'

# Add mongo tap for the community edition
tap 'mongodb/brew'

# Install universal ctags (a ctags fork that is being maintained)
tap 'universal-ctags/universal-ctags'

# Install command line tools
brew 'aria2'
brew 'asdf'
brew 'awscli'
brew 'bat'
brew 'bats'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'dateutils'
brew 'dust'
brew 'editorconfig'
brew 'enca'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'glow'
brew 'gpg'
brew 'hexyl'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'ispell'
brew 'jq'
brew 'leiningen'
brew 'mdcat'
brew 'mongodb/brew/mongodb-community'
brew 'openssl'
brew 'pastel'
brew 'postgresql'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'rlwrap'
brew 'shellcheck'
brew 'siege'
brew 'tmux'
brew 'tmux-xpanes'
brew 'tokei'
brew 'tree'
brew 'universal-ctags', args: ["HEAD"]
brew 'watch'
brew 'wget'
brew 'xsv'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Install neovim
tap 'neovim/neovim'
brew 'neovim'

# Install Apps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
cask 'alacritty'
cask 'appcleaner'
cask 'docker'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'whatsapp'
cask 'visual-studio-code'
cask 'pomodone'
cask 'karabiner-elements'

# Install fonts
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
